{
    "navbar": {
        "home": "Home",
        "projects": "Projects",
        "about": "About me",
        "contact": "Contact me",
        "experience": "Experience"
    },
    "projects": {
        "my_projects": "My Projects",
        "projects_data": {
            "1": {
                "name": "Agenpro",
                "description": "I developed AGENPRO, a full-stack application for appointment management. I built a relational database using SQL and SQLAlchemy with Python, designing secure RESTful endpoints with JWT authentication. On the frontend, I implemented responsive and dynamic user interfaces with React, including reusable components and modules for login, registration, and password recovery. The system also integrates API calls for notifications and was visually designed in Figma, ensuring an intuitive, secure, and scalable user experience."
            },
            "2": {
                "name": "Star Wars API",
                "description": "I built a Python API using SQLAlchemy to manage a precisely structured relational database. The architecture features tables linked through well-defined relationships, enabling efficient and scalable data management. I implemented RESTful endpoints that provide smooth communication between system elements and support integration with external applications. This project showcases solid backend design, data organization, and scalability."
            },
            "3": {
                "name": "Star Wars Blog",
                "description": "The Star Wars Blog is the visual extension of the API, developed on the frontend with React to dynamically display data retrieved from the API. I designed a responsive, interactive, and intuitive interface that allows users to explore characters, planets, and other elements of the Star Wars universe in an immersive way. It leverages reusable components and asynchronous API calls, turning data into an engaging user experience."
            },
            
            "4": {
                "name": "Contact List",
                "description": "Contact List is a web application built with React that performs API calls to manage contacts in an organized way. The interface is intuitive and responsive, allowing users to add, edit, and remove contacts easily. I implemented logic to keep the list updated in real time, focusing on usability and efficiency. This project highlights my skills in state management, API consumption, and user-centered interface design."
            }
        }
    },
    "more": "Explore",
    "about_me": "Web developer with experience in both frontend and backend development, actively involved in all phases of the software development lifecycle. This experience has allowed me to develop strong communication and teamwork skills. I am looking to continue expanding my expertise in software development and to join a company where I can grow professionally while adding value from day one.",
    "techs": "Skills",
    "contact": "Contact me",
    "message": "Have a project or want to work with me?",
    "info_number": "(+34) 632-29-13-87",
    "info_email": "andreseduardo2710@gmail.com",
    "social": "Social",
    "welcome_message": "Welcome to my Showcase",
    "title": "Hey, I'm Andres",
    "send": "Send",
    "sobremi": "Contact",
    "experiences": {
        "my_experiences": "Experience",
        "experience_data": {
            "1": {
                "title": "Frontend Web Developer",
                "company": "Omkrom",
                "period": "05/2025 – 10/2025",
                "location": "Madrid, Spain",
                "description": "Development and design of dynamic and modular user interfaces using Angular and TypeScript, including login, registration, and authentication flows. Experience consuming REST APIs through HTTP services, as well as developing and implementing JWT-based authentication modules. Background in the home automation (domotics) business, gained through hands-on project work and continuous learning."
            },
            "2": {
                "title": "Full Stack Web Developer",
                "company": "MyCityHome",
                "period": "02/2025 – 05/2025",
                "location": "Madrid, Spain",
                "description": "Maintenance and optimization of an ERP system developed with React and TypeScript, with a strong focus on reusable components and performance improvements. Experience consuming APIs for data management and interacting with databases. Development of modular features designed to be integrated into other systems. Creation of a Python-based bot for communication and automation tasks."
            },
            "3": {
                "title": "Frontend Web Developer",
                "company": "CANTV(Compañia Anonima de telefonos de Venezuela)",
                "period": "02/2018 – 03/2019",
                "location": "Madrid, Spain",
                "description": "Development of an internal web application for the company, responsible for layout and design using HTML and CSS following responsive design principles, as well as frontend programming with JavaScript to provide interactivity and functionality. Handling and consuming data using JSON, leveraging jQuery for DOM manipulation and user experience improvement, along with support in testing, functionality validation, and basic database integration."
            }
        }
    }
}