{
    "navbar": {
        "home": "Inicio",
        "projects": "Proyectos",
        "about": "Sobre mí",
        "contact": "Contáctame",
        "experience": "Experiencia"
    },
    "projects": {
        "my_projects": "Mis Proyectos",
        "projects_data": {
            "1": {
                "name": "Agenpro",
                "description": "Diseñé y desarrollé AGENPRO, una aplicación full stack para la gestión de reservas. Implementé una base de datos relacional en SQLAlchemy con Python, creando rutas y endpoints seguros con autenticación JWT y probados con Postman. En el frontend, construí interfaces de usuario dinámicas y responsivas con React, aplicando componentes reutilizables y hooks, además de integrar módulos de login, registro y recuperación de contraseña. El sistema permite llamadas a APIs externas para notificaciones y se planificó visualmente en Figma, garantizando una experiencia intuitiva, segura y escalable para los usuarios."
            },
            "2": {
                "name": "Star Wars API",
                "description": "Desarrollé una API en Python utilizando SQLAlchemy para gestionar una base de datos relacional. La arquitectura incluye tablas vinculadas mediante relaciones bien definidas, lo que permite una gestión eficiente y escalable de los datos. Implementé endpoints que facilitan la comunicación fluida entre los distintos elementos del sistema, habilitando la integración con aplicaciones externas. Este proyecto pone en práctica conceptos de backend sólido, organización de datos y escalabilidad."
            },
            "3": {
                "name": "Star Wars Blog",
                "description": "El Star Wars Blog es la extensión visual de la API, diseñado en frontend con React para mostrar de forma dinámica la información obtenida desde la API. Creé una interfaz interactiva, intuitiva y responsive, que permite al usuario explorar personajes, planetas y otros elementos del universo Star Wars de manera envolvente. Se implementaron componentes reutilizables y llamadas asíncronas a la API, logrando una experiencia atractiva y fluida. Este proyecto refleja mi capacidad de transformar datos en experiencias de usuario memorables."
            },
            
            "4": {
                "name": "Contact List",
                "description": "Contact List es una aplicación web desarrollada con React, que realiza llamadas a una API para gestionar contactos de manera ordenada. La interfaz es intuitiva y responsive, permitiendo agregar, editar y eliminar contactos con facilidad. Implementé lógica para mantener la lista siempre actualizada, priorizando la usabilidad y la eficiencia. Este proyecto demuestra mis habilidades en la gestión de estados, consumo de APIs y diseño de interfaces orientadas al usuario."
            }
        }
    },
    "more": "Explorar",
    "about_me": "Desarrollador web con experiencia en frontend y backend, participando activamente en todas las fases del ciclo de vida del software. Esta implicación me ha permitido desarrollar sólidas habilidades de comunicación y trabajo en equipo. Busco seguir ampliando mi experiencia en el ámbito del desarrollo de software y formar parte de una empresa donde pueda crecer profesionalmente y aportar valor desde el primer día.",
    "techs": "Habilidades",
    "contact": "Contáctame",
    "message": "¿Tienes un proyecto o quieres trabajar conmigo?",
    "sobremi": "Contacto",
    "social": "Redes",
    "title": "Hey, mi nombre es Andrés",
    "welcome_message": "Bienvenido a mi portafolio personal",
    "send": "Enviar",
    "experiences": {
        "my_experiences": "Experiencia",
        "experience_data": {
            "1": {
                "title": "Desarrollador Web Frontend",
                "company": "Omkrom",
                "period": "05/2025 – 10/2025",
                "location": "Madrid, España",
                "description": "Desarrollo y diseño de interfaces de usuario dinámicas y modulares utilizando Angular y TypeScript, incluyendo pantallas de login, registro y flujos de autenticación. Experiencia en el consumo de APIs REST mediante servicios HTTP, así como en el desarrollo e implementación de módulos de autenticación basados en JWT. Formación en el negocio de la domótica, adquirida a través de la participación en proyectos y el aprendizaje continuo."
            },
            "2": {
                "title": "Desarrollador Web Full Stack",
                "company": "MyCityHome",
                "period": "02/2025 – 05/2025",
                "location": "Madrid, España",
                "description": "Mantenimiento y optimización de un sistema ERP desarrollado con React y TypeScript, con especial foco en el uso de componentes reutilizables y la mejora del rendimiento. Experiencia en el consumo de APIs para la gestión de datos y en el control e interacción con bases de datos. Desarrollo de funcionalidades modulares integrables en otros sistemas. Creación de un bot en Python para tareas de comunicación y automatización."
            },
            "3": {
                "title": "Desarrollador Web Frontend",
                "company": "CANTV(Compañía Anónima Nacional Teléfonos de Venezuela)",
                "period": "02/2018 – 03/2019",
                "location": "Caracas, Venezuela",
                "description": "Desarrollo de una aplicación web interna para la empresa, encargándome de la maquetación y el diseño con HTML y CSS bajo principios de diseño responsivo, así como de la programación frontend con JavaScript para aportar interactividad y funcionalidad. Manejo y consumo de datos mediante JSON, uso de jQuery para la manipulación del DOM y mejora de la experiencia de usuario, además de soporte en testing, validación de funcionalidades e integración básica con bases de datos."
            }
        }
    }
}