[
    {
        "id": 1,
        "name": "Agenpro",
        "color": "black",
        "description": "Agenpro es una aplicación diseñada para gestionar la reserva de citas para una amplia variedad de servicios. Su objetivo es optimizar el proceso de agendamiento tanto para empresas como para clientes, permitiendo una planificación más eficiente. Al automatizar las reservas, Agenpro ayuda a reducir tiempos de espera, minimizar errores y mejorar la experiencia del usuario, generando un ahorro significativo de tiempo y recursos para todos los involucrados.",
        "url": "https://github.com/4GeeksAcademy/FS-PT-81-Final-Proyect-Colaborativo"
    },
    {
        "id": 2,
        "name": "Star-Wars Api",
        "color": "black",
        "description": "Este proyecto consiste en una API desarrollada en Python, respaldada por una base de datos relacional estructurada con precisión. La arquitectura incluye tablas vinculadas mediante relaciones bien definidas, lo que permite una gestión eficiente de los datos y una comunicación fluida entre los distintos elementos del sistema. Su diseño facilita tanto la escalabilidad como la integración con otras aplicaciones o servicios.",
        "url": "https://github.com/4GeeksAcademy/FS-PT-81-RestApiStarwars-AndresGarcia2"
    },
    {
        "id": 3,
        "name": "Star-Wars-blog",
        "color": "black",
        "description": "Este blog es la extensión visual del proyecto API Star Wars, diseñado para presentar de forma dinámica y atractiva la información obtenida desde la API. Desarrollado en el frontend, el blog transforma los datos en una experiencia interactiva para el usuario, permitiendo explorar personajes, planetas y otros elementos del universo Star Wars de manera intuitiva y visualmente envolvente.",
        "url": "https://github.com/Elandruf/FS-PT-81-StarWarsAndresGarcia"
    },
    {
        "id": 4,
        "name": "Contact-List",
        "color": "black",
        "description": "Contact List es una solución práctica y dinámica para gestionar tu lista de contactos. Con una interfaz intuitiva e interactiva, podrás añadir, editar y eliminar contactos de forma rápida y sencilla, optimizando tu experiencia de usuario y manteniendo tu agenda siempre actualizada.",
        "url": ""
    }
]